app/views/users/show.html.erb

SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = $1  [["user_id", 1]]
---

 <span><% @user.trips.each do |t| %></span><br>