app/controllers/posts_controller.rb

	def create
		@trip = Trip.find(params[:trip_id])
		@post = @trip.posts.create(post_params)
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "posts" ("title", "context", "trip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Lunch with random guy"], ["context", "asdfas"], ["trip_id", 27], ["created_at", "2016-02-26 15:32:52.581946"], ["updated_at", "2016-02-26 15:32:52.581946"]]