app/controllers/trips_controller.rb

INSERT INTO "trips" ("location", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["location", "bkjksdflkahsdf"], ["description", "asdfad"], ["user_id", 2], ["created_at", "2016-02-26 03:58:54.195431"], ["updated_at", "2016-02-26 03:58:54.195431"]]
---
	def create
		@trip = current_user.trips.create(trip_params)

SELECT  "trips".* FROM "trips" WHERE "trips"."user_id" = $1 AND "trips"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 6]]
---
 	def show
		@trip = current_user.trips.find(params[:id])

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 6]]
---
	def edit
		@trip = Trip.find(params[:id])

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 19]]
UPDATE "trips" SET "location" = $1, "updated_at" = $2 WHERE "trips"."id" = $3  [["location", "sdafsdfasdfsadf"], ["updated_at", "2016-02-26 08:17:00.555474"], ["id", 20]]
---
	def update
		trip = Trip.find(params[:id])
		trip.update_attributes(trip_params)

SELECT  "trips".* FROM "trips" WHERE "trips"."user_id" = $1 AND "trips"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 6]]
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 2]]
---
	def destroy
		trip = current_user.trips.find(params[:id])
    trip.destroy