app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		@user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "asdsadf"], ["updated_at", "2016-02-26 03:02:05.739923"], ["id", 1]]
---
	def update
		user = User.find(params[:id])
		user.update_attributes(user_params)